espruino/Espruino/targetlibs/nrf5x/nrf51_sdk/examples/ble_peripheral/ble_app_hrs_rtx/main.c
#define DEAD_BEEF                            0xDEADBEEF                                 /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */


static uint16_t                              m_conn_handle = BLE_CONN_HANDLE_INVALID;   /**< Handle of the current connection. */
static ble_bas_t                             m_bas;                                     /**< Structure used to identify the battery service. */
static ble_hrs_t                             m_hrs;                                     /**< Structure used to identify the heart rate service. */
static bool                                  m_rr_interval_enabled = true;              /**< Flag for enabling and disabling the registration of new RR interval measurements (the purpose of disabling this is just to test sending HRM without RR interval data. */

static sensorsim_cfg_t                       m_battery_sim_cfg;                         /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t                     m_battery_sim_state;                       /**< Battery Level sensor simulator state. */
static sensorsim_cfg_t                       m_heart_rate_sim_cfg;                      /**< Heart Rate sensor simulator configuration. */
static sensorsim_state_t                     m_heart_rate_sim_state;                    /**< Heart Rate sensor simulator state. */
static sensorsim_cfg_t                       m_rr_interval_sim_cfg;                     /**< RR Interval sensor simulator configuration. */
static sensorsim_state_t                     m_rr_interval_sim_state;                   /**< RR Interval sensor simulator state. */

static osTimerId                             m_battery_timer_id;                        /**< Battery timer. */
static osTimerId                             m_heart_rate_timer_id;                     /**< Heart rate measurement timer. */
static osTimerId                             m_rr_interval_timer_id;                    /**< RR interval timer. */
static osTimerId                             m_sensor_contact_timer_id;                 /**< Sensor contact detected timer. */

static dm_application_instance_t             m_app_handle;                              /**< Application identifier allocated by device manager */

static ble_uuid_t                            m_adv_uuids[] =                            /**< Universally unique service identifiers. */
{
    {BLE_UUID_HEART_RATE_SERVICE,         BLE_UUID_TYPE_BLE},
    {BLE_UUID_BATTERY_SERVICE,            BLE_UUID_TYPE_BLE},
    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
};

static void battery_level_meas_timeout_handler(void const * p_context);                 /**< Battery timeout handler. */
static void heart_rate_meas_timeout_handler(void const * p_context);                    /**< Heart rate measurement timeout handler. */
static void rr_interval_timeout_handler(void const * p_context);                        /**< RR interval timeout handler. */
static void sensor_contact_detected_timeout_handler(void const * p_context);            /**< Sensor contact detected timeout handler. */

osTimerDef(battery_timer, battery_level_meas_timeout_handler);                          /**< Definition of battery timer. */
osTimerDef(heart_rate_timer, heart_rate_meas_timeout_handler);                          /**< Definition of heart rate timer. */
osTimerDef(rr_interval_timer, rr_interval_timeout_handler);                             /**< Definition of RR interval timer. */
osTimerDef(sensor_contact_timer, sensor_contact_detected_timeout_handler);              /**< Definition of sensor contact detected timer. */

osPoolDef(ble_evt_pool, 8, ble_evt_t);                                                  /**< Definition of memory pool for ble_stack_thread */
osPoolId ble_evt_pool;                                                                  /**< Memory pool for ble_stack_thread */
osMessageQDef(ble_stack_msg_box, 8, ble_evt_t);                                         /**< Definition of message box for ble_stack_thread */
osMessageQId ble_stack_msg_box;                                                         /**< Message box for ble_stack_thread */

osThreadId ble_stack_thread_id;                                                         /**< BLE Stack thread */

void ble_stack_thread(void const * arg);                                                
osThreadDef(ble_stack_thread, osPriorityAboveNormal, 1, 0);                             /**< Definition of BLE Stack thread */

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for performing battery measurement and updating the Battery Level characteristic
 *        in Battery Service.
 */
static void battery_level_update(void)
{
    uint32_t err_code;
    uint8_t  battery_level;

    battery_level = (uint8_t)sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

    err_code = ble_bas_battery_level_update(&m_bas, battery_level);

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_BUFFERS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
        )
    {
        APP_ERROR_HANDLER(err_code);
    }
}


/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void const * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}


